Revit 2026 API

# ViewSetErase Method

---

Removes a specified view from the set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	View item
)
```
```vb
Public Overridable Function Erase (
	item As View
) As Integer
```
```cpp
public:
virtual int Erase(
	View^ item
)
```
```fsharp
abstract Erase :
        item : View -> int
override Erase :
        item : View -> int
```

#### Parameters

item View
    The view to be erased.

#### Return Value

Int32The number of views that were erased from the set.

#### Reference

ViewSet Class

Autodesk.Revit.DB Namespace